Tekla.Structures.ModelInternal.Dstv.DstvMarkRow
The contour marking point information.

Tekla.Structures.ModelInternal.Dstv.DstvMarkRow.#ctor
Creates a new DstvMarkRow instance.

Tekla.Structures.ModelInternal.Dstv.DstvMarkRow.DstvView
The dstv view type: front, top, back or below

Tekla.Structures.ModelInternal.Dstv.DstvMarkRow.Position
The contour marking point position.

Tekla.Structures.ModelInternal.Dstv.DstvMarkRow.Radius
The radius.